.homepage/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN""http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
<!-- Sun 01 Dec 2019 02:51:50 PM EET
	_    _                        _ _  ___           _          _ 
   / \  | |__  _ __ ___   ___  __| | |/ / |__   __ _| | ___  __| |
  / _ \ | '_ \| '_ ` _ \ / _ \/ _` | ' /| '_ \ / _` | |/ _ \/ _` |
 / ___ \| | | | | | | | |  __/ (_| | . \| | | | (_| | |  __/ (_| |
/_/   \_\_| |_|_| |_| |_|\___|\__,_|_|\_\_| |_|\__,_|_|\___|\__,_| ahmed_khaledAtzohoDoTcom
                                                                  

-->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ahmeds' Homepage file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ahmed Khaled" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>


<body>
<div id="content">
<h1 class="title">Ahmeds' Homepage file</h1>
<div id="outline-container-orgdbc5910" class="outline-2">
<h2 id="orgdbc5910"><span class="section-number-2">1</span> Links Bookmarks</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
	<li><a href="https://ddg.gg/lite">DuckDuckGo</a></li>
</ul>
</div>

<div id="outline-container-orga7a225c" class="outline-3">
	<h3 id="orga7a225c"><span class="section-number-3">1.1</span> Community</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
		<li><a href="https://nixers.net/">*Nixers</a></li>
		<li><a href="https://lainchan.org/">LAINCHAN</a></li>
		<li><a href="https://arisuchan.jp/%CE%BB/"><i>λ</i> - programming</a></li>
		<li><a href="https://endchan.xyz/tech/"><i>tech</i> - Technology</a></li>
		<li><a href="https://boards.systemspace.link/">TSUKICHAN</a></li>
		<li><a href="http://4-ch.net/code/">Programming @4-ch</a></li>
		<li><a href="https://wirechan.org/g/"><i>g</i> - Technology</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfacebe6" class="outline-3">
	<h3 id="orgfacebe6"><span class="section-number-3">1.2</span> Computer Science</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
		<li><a href="https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-fall-2010/video-lectures/">Math4CS old</a></li>
		<li><a href="https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-042j-mathematics-for-computer-science-spring-2015/index.htm">Mathematics for Computer Science</a></li>
		<li><a href="https://ocw.mit.edu/courses/mathematics/18-01sc-single-variable-calculus-fall-2010/">18<sub>01</sub> Singel Var Cal</a></li>
		<li><a href="https://teachyourselfcs.com/">Teach yourself CS</a></li>
		<li><a href="https://functionalcs.github.io/curriculum/#orgeff02fd">λ Self-Learning</a></li>
		<li><a href="https://github.com/ossu/computer-science">OSSU CS</a></li>
		<li><a href="https://www.youtube.com/playlist?list=PLOtl7M3yp-DX32N0fVIyvn7ipWKNGmwpp">Algorithms Lectures</a></li>
		<li><a href="http://www3.cs.stonybrook.edu/~skiena/373/">Algorithms website page</a></li>
</ul>
</div>
</div>
<div id="outline-container-org318715a" class="outline-3">
	<h3 id="org318715a"><span class="section-number-3">1.3</span> Learning</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
		<li><a href="http://gen.lib.rus.ec/">Library Genesis</a></li>
		<li><a href="http://134.209.43.254:8083/login?next=/">#DEAD DeepSpec Library | Recently Ad</a></li>
		<li><a href="http://audiobookbay.nl/">audiobookbay</a></li>
		<li><a href="https://teachyourselfcs.com/">Teach Yourself Computer Science</a></li>
		<li><a href="https://github.com/ossu/computer-science">ossu/computer-science</a></li>
		<li><a href="https://thufie.lain.haus/liberation.html">EBook Liberation Guide</a></li>
		<li><a href="https://www.webtoons.com/en/drama/dr-frost/list?title_no=371&amp;page=13">Dr. Frost</a></li>
</ul>
</div>
</div>
<div id="outline-container-org303028f" class="outline-3">
	<h3 id="org303028f"><span class="section-number-3">1.4</span> Medicine</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
		<li><a href="https://forsanalazhar.wixsite.com/medical-students">Forsan Alazhar</a></li>
		<li><a href="https://ocw.mit.edu/courses/health-sciences-and-technology/hst-035-principle-and-practice-of-human-pathology-spring-2003/lecture-notes/">Pathology</a></li>
		<li><a href="https://ocw.mit.edu/courses/health-sciences-and-technology/hst-151-principles-of-pharmacology-spring-2005/lecture-notes/">Pharmacology</a></li>
</ul>
</div>
</div>
<div id="outline-container-org291816f" class="outline-3">
	<h3 id="org291816f"><span class="section-number-3">1.5</span> News</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
		<li><a href="https://serializer.ioi/cozydove">News | Serilizer</a></li>
		<li><a href="https://news.ycombinator.com/">Hacker News</a></li>
		<li><a href="https://news.bubblin.io/">HackerNews for Books</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd459c02" class="outline-3">
	<h3 id="orgd459c02"><span class="section-number-3">1.6</span> Technology</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
		<li><a href="https://texteditors.org/cgi-bin/wiki.pl">Wiki|TextEditors</a></li>
</ul>
</div>
<div id="outline-container-org10edec7" class="outline-4">
<h4 id="org10edec7"><span class="section-number-4">1.6.1</span> intersting stuff</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
		<li><a href="https://github.com/tuvtran/project-based-learning">ProjectBase0learning</a></li>
		<li><a href="https://github.com/danistefanovic/build-your-own-x%20%20%20">ProjectBase1learning</a></li>
		<li><a href="https://github.com/rby90/Project-Based-Tutorials-in-C">ProjectBase2learning</a></li>
		<li><a href="https://github.com/hellerve/programming-talks">Programming Talk</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ahmed Khaled</p>
<p class="date">Created: 2019-10-15 Tue 20:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
